package com.donald.factory;

import java.util.Random;

import com.donald.domain.Shape;

/**
 * 
 * @author Donald
 *	创建一个形状类
 */
public class ShapeFactory {
	
	/*
	 * 三维数组保存可能的形状
	 * 每个形状为十六个格子，填1代表有，填0代表没有
	 * 
	 */
	private static int shapes[][][] = new int[][][] {
		/* 第一种 */{ /** ***** */
		{ 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 } },

		/* 第二种 */
		{ /** ********* */
		{ 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0 },

		{ 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 } },
		/* 第三种 */
		{ /** ******* */
		{ 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },

		{ 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0 } },
		/* 第四种 */
		{ /** ******** */
		{ 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, } },
		/* 第五种 */
		{ /** ******** */
		{ 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 } },
		/* 第六种 */
		{ /** *********** */
		{ 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 } },

		/* 第七种 */
		{ /** ********** */
		{ 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

		{ 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0 } },

		};
	
	/*
	 * 每调用一次该方法，就会随机产生一个Shape对象 
	 */
	public static Shape createShape() {
		//随机数，形状种类
		Random rd = new Random();
		int type = rd.nextInt(shapes.length);
		//随机数，这一type下的某一种状态,which
		int which = rd.nextInt(shapes[type].length);
		//创建Shape对象
		Shape shape = new Shape(shapes[type],which);
		return shape;
	}
}
